[
    {
        "id": 1,
        "estate_title": "Luxury Villa with Ocean View in Malibu",
        "category": "Residential",
        "segment_name": "Single-family Homes",
        "description": "Perched atop a cliff overlooking the sparkling Pacific Ocean, this luxury villa offers an unparalleled living experience. Spread across 5000 square feet of meticulously designed space, every corner of this residence exudes opulence and refinement. Step inside to be greeted by soaring ceilings and expansive windows that frame breathtaking views of the azure waters below. The main living area features plush furnishings and a cozy fireplace, perfect for relaxing or entertaining guests. The gourmet kitchen is a chef's dream, equipped with state-of-the-art appliances and ample counter space. Retreat to the sumptuous master suite, complete with a private balcony and spa-like ensuite bathroom. Outside, the infinity-edge swimming pool blends seamlessly with the horizon, inviting you to take a refreshing dip while soaking in the panoramic vistas. With lush landscaping and multiple outdoor seating areas, the grounds offer the ideal setting for alfresco dining or sunset cocktails. Located in the prestigious enclave of Malibu, California, this villa is more than just a home – it's a lifestyle.",
        "price": "$2,500,000",
        "status": "Sale",
        "area": "5000 sq ft",
        "location": "Malibu, California",
        "coordinates": {
            "latitude": 36.7749,
            "longitude": -120.4194
        },
        "facilities": ["Living room", "Swimming pool", "Kitchen", "Garden"],
        "image":{
            "main": "https://i.ibb.co/Fh82VMz/1-1.jpg",
            "slider_image_1": "https://i.ibb.co/FzFphMG/1-2.jpg",
            "slider_image_2": "https://i.ibb.co/KFRQbSk/1-3.jpg",
            "slider_image_3": "https://i.ibb.co/94PHF53/1-4.jpg"
        },
        "rating": 4.5,
        "reviews": 102
    },
    {
        "id": 2,
        "estate_title": "Spacious Family Home in Suburbia",
        "category": "Residential",
        "segment_name": "Single-family Homes",
        "description": "Welcome home to this spacious single-family residence located in a quiet suburban neighborhood. With ample room for the whole family, this home offers comfortable living spaces and modern amenities. The open-concept layout is perfect for entertaining, with a large living area that flows seamlessly into the gourmet kitchen. Upstairs, you'll find a luxurious master suite retreat and generously sized bedrooms for children or guests. Outside, the backyard provides the ideal setting for outdoor gatherings or simply enjoying the fresh air. With its convenient location and family-friendly amenities, this home is perfect for those seeking suburban tranquility.",
        "price": "$500,000",
        "status": "Sale",
        "area": "2500 sq ft",
        "location": "Suburban, Anytown",
        "facilities": ["Spacious living area", "Gourmet kitchen", "Backyard"],
        "coordinates": {
            "latitude": 37.7749,
            "longitude": -122.4194
        },
        "image":{
            "main": "https://i.ibb.co/yy06Vjk/2-1.jpg",
            "slider_image_1": "https://i.ibb.co/frsDqLc/2-2.jpg",
            "slider_image_2": "https://i.ibb.co/Srph531/2-3.jpg",
            "slider_image_3": "https://i.ibb.co/StKsF4x/2-4.jpg"
        },
        "rating": 5,
        "reviews": 85
    },
    {
        "id": 3,
        "estate_title": "Luxury Townhouse in Downtown",
        "category": "Residential",
        "segment_name": "Townhouses",
        "description": "Experience luxury living in this stunning townhouse situated in a prime location. With sleek design and high-end finishes, this home offers contemporary elegance and urban convenience. The spacious interior features an open-concept layout, perfect for entertaining guests or relaxing in style. The gourmet kitchen is equipped with top-of-the-line appliances and custom cabinetry, making it a chef's dream. Upstairs, the master suite boasts a private balcony and spa-like ensuite bathroom, providing a tranquil retreat from the hustle and bustle of city life. Outside, a private patio offers the perfect spot for al fresco dining or enjoying a morning coffee. With its convenient location and luxurious amenities, this townhouse is urban living at its finest.",
        "price": "$1,200,000",
        "status": "Sale",
        "area": "2000 sq ft",
        "location": "Downtown, Metropolis",
        "facilities": ["Open-concept layout", "Gourmet kitchen", "Private balcony"],
        "coordinates": {
            "latitude": 34.0522,
            "longitude": -118.2437
        },
        "image":{
            "main": "https://i.ibb.co/fr1G37K/3-1.jpg",
            "slider_image_1": "https://i.ibb.co/Hr1YFFv/3-2.jpg",
            "slider_image_2": "https://i.ibb.co/bRRdX7V/3-3.jpg",
            "slider_image_3": "https://i.ibb.co/RcVMMzR/3-4.jpg"
        },
        "rating": 5,
        "reviews": 110
    },
    {
        "id": 4,
        "estate_title": "Modern Apartment with City Views",
        "category": "Residential",
        "segment_name": "Apartments",
        "description": "Live in style in this modern apartment boasting sweeping views of the city skyline. Located in a sought-after building, this unit offers luxurious amenities and convenient urban living. The open-concept layout is flooded with natural light, creating a bright and inviting atmosphere. The kitchen features sleek appliances and ample counter space, making it perfect for cooking gourmet meals or entertaining guests. Retreat to the spacious bedroom with ensuite bathroom for ultimate comfort and privacy. Outside, a private balcony provides the perfect spot for enjoying morning coffee or watching the sunset over the city. With its prime location and contemporary design, this apartment is the epitome of urban chic.",
        "price": "$900,000",
        "status": "Sale",
        "area": "1200 sq ft",
        "location": "City Center, Metroville",
        "facilities": ["Open-concept layout", "Modern kitchen", "Private balcony"],
        "coordinates": {
            "latitude": 40.7128,
            "longitude": -74.0060
        },
        "image":{
            "main": "https://i.ibb.co/wMK7jDD/4-1.jpg",
            "slider_image_1": "https://i.ibb.co/Y7kLwht/4-2.jpg",
            "slider_image_2": "https://i.ibb.co/rwCFRrr/4-3.jpg",
            "slider_image_3": "https://i.ibb.co/NjTQyqQ/4-4.jpg"
        },
        "rating": 4.5,
        "reviews": 160
    },
    {
        "id": 5,
        "estate_title": "Student Housing Near University Campus",
        "category": "Residential",
        "segment_name": "Student Housing",
        "description": "Calling all students! Live in style in this modern student housing complex located just steps away from the university campus. Designed with student living in mind, this complex offers comfortable accommodations and convenient amenities. Each unit features a private bedroom and ensuite bathroom, providing privacy and comfort for students. The shared living area and kitchen are perfect for socializing with roommates or studying together. Outside, a communal courtyard offers the perfect spot for outdoor gatherings or enjoying a break between classes. With its prime location and student-friendly amenities, this housing complex is the perfect place to call home during your college years.",
        "price": "$700/month",
        "status": "Rent",
        "area": "600 sq ft",
        "location": "University District, Collegeland",
        "facilities": ["Private bedroom", "Ensuite bathroom", "Shared living area"],
        "coordinates": {
            "latitude": 47.6062,
            "longitude": -122.3321
        },
        "image":{
            "main": "https://i.ibb.co/qp8fbVV/5-1.jpg",
            "slider_image_1": "https://i.ibb.co/9HpsYhQ/5-2.jpg",
            "slider_image_2": "https://i.ibb.co/rwZ9MDz/5-3.jpg",
            "slider_image_3": "https://i.ibb.co/yBJmHcy/5-4.jpg"
        },
        "rating": 4.5,
        "reviews": 60        
    },
    {
        "id": 6,
        "estate_title": "Luxury Villa Retreat in the Mountains",
        "category": "Residential",
        "segment_name": "Mountain Villas",
        "description": "Escape to a luxurious villa retreat nestled in the breathtaking mountains. This stunning property offers unparalleled privacy and serenity, surrounded by majestic peaks and lush forests. The villa features spacious living areas, elegant furnishings, and modern amenities, providing the ultimate in comfort and relaxation. Enjoy panoramic views from the expansive terrace or take a dip in the private infinity pool. With hiking trails, scenic overlooks, and outdoor adventures just steps away, this mountain villa offers the perfect getaway for nature lovers and outdoor enthusiasts.",
        "price": "$1,000/night",
        "status": "Rent",
        "area": "6000 sq ft",
        "location": "Mountain Range, Anywhere",
        "facilities": ["Private infinity pool", "Expansive terrace", "Modern amenities"],
        "coordinates": {
            "latitude": 39.5501,
            "longitude": -105.7821
        },
        "image":{
            "main": "https://i.ibb.co/PWjy28V/6-1.jpg",
            "slider_image_1": "https://i.ibb.co/s6nRwd9/6-2.jpg",
            "slider_image_2": "https://i.ibb.co/FXT05Sf/6-3.jpg",
            "slider_image_3": "https://i.ibb.co/8MgC3Sd/6-4.jpg"
        },
        "rating": 5,
        "reviews": 210
    },
    {
        "id": 7,
        "estate_title": "Downtown Loft with Urban Views",
        "category": "Residential",
        "segment_name": "City Lofts",
        "description": "Experience the vibrant energy of downtown living in this stylish loft Rental. Situated in the heart of the city, this loft offers easy access to restaurants, shops, and cultural attractions. The open-concept layout features high ceilings, exposed brick walls, and industrial accents, creating a chic urban vibe. Relax in the spacious living area or whip up a meal in the gourmet kitchen. With floor-to-ceiling windows offering panoramic city views, this loft is the perfect retreat for urban explorers and city lovers.",
        "price": "$300/night",
        "status": "Rent",
        "area": "1200 sq ft",
        "location": "Downtown, Anytown",
        "facilities": ["High ceilings", "Exposed brick walls", "Panoramic city views"],
        "coordinates": {
            "latitude": 34.0522,
            "longitude": -118.2437
        },
        "image":{
            "main": "https://i.ibb.co/cwKfVpW/7-1.jpg",
            "slider_image_1": "https://i.ibb.co/ZWTyGxs/7-2.jpg",
            "slider_image_2": "https://i.ibb.co/hCsW5pn/7-3.jpg",
            "slider_image_3": "https://i.ibb.co/3zC29GX/7-4.jpg"
        },
        "rating": 5,
        "reviews": 300
    },
    {
        "id": 8,
        "estate_title": "Beachfront Bungalow Paradise",
        "category": "Residential",
        "segment_name": "Beach Bungalows",
        "description": "Escape to paradise in this charming beachfront bungalow located on a pristine tropical island. Nestled amidst swaying palm trees and turquoise waters, this bungalow offers the ultimate in island living. Step out onto the powdery white sand beach or take a dip in the crystal-clear ocean. The bungalow features a cozy interior with tropical-inspired decor, creating a relaxed and inviting atmosphere. With hammocks swaying in the breeze and stunning sunsets painting the sky, this beachfront retreat is the perfect destination for a romantic getaway or family vacation.",
        "price": "$500/night",
        "status": "Rent",
        "area": "800 sq ft",
        "location": "Tropical Island, Paradise",
        "facilities": ["Beachfront location", "Tropical-inspired decor", "Hammocks"],
        "coordinates": {
            "latitude": 21.3069,
            "longitude": -157.8583
        },
        "image":{
            "main": "https://i.ibb.co/sscHbqf/8-1.jpg",
            "slider_image_1": "https://i.ibb.co/KVGRL3Q/8-2.jpg",
            "slider_image_2": "https://i.ibb.co/vhg7ftT/8-3.jpg",
            "slider_image_3": "https://i.ibb.co/SxJGTXS/8-4.jpg"
        },
        "rating": 4.5,
        "reviews": 40
    },
    {
        "id": 9,
        "estate_title": "Historic Cottage in the Countryside",
        "category": "Residential",
        "segment_name": "Countryside Cottages",
        "description": "Experience the charm of a bygone era in this historic countryside cottage. Dating back to the 18th century, this lovingly restored cottage offers a glimpse into the past while providing modern comforts and conveniences. Nestled amidst rolling hills and scenic farmland, the cottage is the perfect retreat for nature lovers and history enthusiasts alike. Relax by the fireplace with a good book or explore the picturesque countryside on foot or bicycle. With its peaceful setting and rustic charm, this historic cottage is the ideal destination for a relaxing countryside getaway.",
        "price": "$200/night",
        "status": "Rent",
        "area": "1000 sq ft",
        "location": "Rural Countryside, Anywhere",
        "facilities": ["Historic charm", "Fireplace", "Scenic countryside views"],
        "coordinates": {
            "latitude": 51.5074,
            "longitude": -0.1278
        },
        "image":{
            "main": "https://i.ibb.co/48p4QH7/9-1.jpg",
            "slider_image_1": "https://i.ibb.co/0VSVLB5/9-2.jpg",
            "slider_image_2": "https://i.ibb.co/88myBHz/9-3.jpg",
            "slider_image_3": "https://i.ibb.co/4YQgRt8/9-4.jpg"
        },
        "rating": 5,
        "reviews": 140
    }
]